Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32_master/src/Main.cpp

/* Todo*/
// https://github.com/espressif/arduino-esp32/issues/7779

#define ESTIMATE_LOADCELL_VARIANCE
#define ISV_COMMUNICATION
//#define PRINT_SERVO_STATES

#define DEBUG_INFO_0_CYCLE_TIMER 1
#define DEBUG_INFO_0_STEPPER_POS 2
#define DEBUG_INFO_0_LOADCELL_READING 4
#define DEBUG_INFO_0_SERVO_READINGS 8
#define DEBUG_INFO_0_PRINT_ALL_SERVO_REGISTERS 16
#define DEBUG_INFO_0_STATE_BASIC_INFO_STRUCT 32
#define DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT 64
#define DEBUG_INFO_0_CONTROL_LOOP_ALGO 128



#define PI 3.14159267
#define DEG_TO_RAD PI / 180

#include "Arduino.h"
#include "Main.h"
#include "esp_system.h"
#ifndef CONFIG_IDF_TARGET_ESP32C6
  #include "soc/rtc_cntl_reg.h"
#endif
#include "FanatecInterface.h"
#include "OTA_Pull.h"
#include "Version_Board.h"
#include <EEPROM.h>
#include <DiyActivePedal_types.h>
#include "Wire.h"
#include "SPI.h"
#include "Controller.h"
#include <MovingAverageFilter.h>
#include <TaskScheduler.h>

// https://www.tutorialspoint.com/cyclic-redundancy-check-crc-in-arduino
uint16_t checksumCalculator(uint8_t * data, uint16_t length)
{
   uint16_t curr_crc = 0x0000;
   uint8_t sum1 = (uint8_t) curr_crc;
   uint8_t sum2 = (uint8_t) (curr_crc >> 8);
   int index;
   for(index = 0; index < length; index = index+1)
   {
      sum1 = (sum1 + data[index]) % 255;
      sum2 = (sum2 + sum1) % 255;
   }
   return (sum2 << 8) | sum1;
}

DAP_config_st dap_config_st[3];
DAP_calculationVariables_st dap_calculationVariables_st;
DAP_state_basic_st dap_state_basic_st[3];
DAP_state_extended_st dap_state_extended_st[3];
DAP_actions_st dap_actions_st[3];
DAP_bridge_state_st dap_bridge_state_st;
DAP_config_st dap_config_st_Clu;
DAP_config_st dap_config_st_Brk;
DAP_config_st dap_config_st_Gas;
DAP_config_st dap_config_st_Temp;
DAP_ESPPairing_st dap_esppairing_st;//saving
DAP_ESPPairing_st dap_esppairing_lcl;//sending
//DAP_config_st dap_config_st_store[3];
DAP_bridge_state_st dap_bridge_state_lcl;//
DAP_action_ota_st dap_action_ota_st;
#include "ESPNOW_lib.h"

#define EEPROM_offset 15

bool isSerialConfigGet[3]={false, false, false};

#ifndef CONFIG_IDF_TARGET_ESP32S3
  #include <rtc_wdt.h>
#endif
#ifdef USING_LED
  #include "soc/soc_caps.h"
  #include <Adafruit_NeoPixel.h>
  #ifdef LED_ENABLE_WAVESHARE
    #define LEDS_COUNT 1
    Adafruit_NeoPixel pixels(LEDS_COUNT, LED_GPIO, NEO_RGB + NEO_KHZ800);
  #endif
  #ifdef LED_ENABLE_DONGLE
    #define LEDS_COUNT 3
    Adafruit_NeoPixel pixels(LEDS_COUNT, LED_GPIO, NEO_GRB + NEO_KHZ800);
  #endif
  #define CHANNEL 0
  #define LED_BRIGHT 30
  /*
  static const crgb_t L_RED = 0xff0000;
  static const crgb_t L_GREEN = 0x00ff00;
  static const crgb_t L_BLUE = 0x0000ff;
  static const crgb_t L_WHITE = 0xe0e0e0;
  static const crgb_t L_YELLOW = 0xffde21;
  static const crgb_t L_ORANGE = 0xffa500;
  static const crgb_t L_CYAN = 0x00ffff;
  static const crgb_t L_PURPLE = 0x800080;
  */

#endif

#ifdef Fanatec_comunication
  FanatecInterface fanatec(Fanatec_serial_RX, Fanatec_serial_TX, Fanatec_plug); // RX: GPIO18, TX: GPIO17, PLUG: GPIO16
  bool Fanatec_Mode=false;
#endif

#ifdef OTA_Update
  void otaUpdateTask(void *pvParameters);
#endif


#ifdef External_RP2040
  #include "RP2040PicoUART.h"
  RP2040PicoUART *_rp2040picoUART;
  DAP_JoystickUART_State dap_joystickUART_state_lcl;
#endif

#ifdef Using_MCP4728
  #include <Adafruit_MCP4728.h>
  Adafruit_MCP4728 mcp;
  TwoWire MCP4728_I2C= TwoWire(1);
  bool MCP_status =false;
#endif

//global variables
bool configUpdateAvailable[3] = {false, false, false};                              
  //DAP_config_st dap_config_st_local;
int32_t joystickNormalizedToInt32 = 0;                           
bool resetPedalPosition = false;
bool dap_action_update[3]= {false,false,false};
MovingAverageFilter rssi_filter(30);
int32_t joystickNormalizedToInt32_local = 0;
unsigned long pedal_last_update[3]={1,1,1};
uint8_t pedal_avaliable[3]={0,0,0};
uint8_t LED_Status=0; //0=normal 1= pairing
TaskScheduler taskScheduler;
//task define here
void espNowCommunicationTxTask( void * pvParameters);
void joystickUpdateTask(void *pvParameters);
void ledUpdateTask( void * pvParameters);
void serialCommunicationRxTask( void * pvParameters);
void serialCommunicationTxTask( void * pvParameters);
void ledUpdateDongleTask( void * pvParameters);
void fanatecUpdateTask(void *pvParameters);

void setup()
{

  #ifdef External_RP2040
    _rp2040picoUART= new RP2040PicoUART(RP2040rxPin, RP2040txPin, handshakeGPIO, RP2040baudrate);
  #endif

  #if PCB_VERSION == 5 || PCB_VERSION == 6 || PCB_VERSION == 7 || PCB_VERSION == 8 ||PCB_VERSION == 9
    //Serial.setTxTimeoutMs(0);
    Serial.setRxBufferSize(1024);
    Serial.setTimeout(5);
    Serial.begin(3000000);
  #else
    Serial.setRxBufferSize(1024);
    Serial.begin(921600);
    Serial.setTimeout(5);

  #endif
  #ifdef USB_JOYSTICK
	  SetupController();
  #endif
  Serial.println(" ");
  Serial.println(" ");
  Serial.println(" ");
  
  Serial.println("[L]This work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.");
  Serial.println("[L]Please check github repo for more detail: https://github.com/ChrGri/DIY-Sim-Racing-FFB-Pedal");
  #ifdef OTA_Update
    Serial.print("[L]Board:");
    Serial.println(BRIDGE_BOARD);
    Serial.print("[L]Version:");
    Serial.println(BRIDGE_FIRMWARE_VERSION);
  #endif
  parse_version(BRIDGE_FIRMWARE_VERSION,&versionMajor,&versionMinor,&versionPatch);
  delay(5);
  //create message queue
  messageQueueHandle = xQueueCreate(10, sizeof(ESPNOW_Message));
  if (messageQueueHandle == NULL)
  {
    Serial.println("[L]Error during xqueue creation.");
    ESP.restart();
  }
  #ifdef ESPNow_Pairing_function
    //button read setup
    pinMode(Pairing_GPIO, INPUT_PULLUP);
    EEPROM.begin(256);
  #endif
  #if !defined(CONFIG_IDF_TARGET_ESP32S3) && !defined(CONFIG_IDF_TARGET_ESP32C6)
    disableCore0WDT();
    disableCore1WDT();
  #endif
  //enable ESP-NOW
  ESPNow_initialize();
  
  #ifdef Using_MCP4728
    MCP4728_I2C.begin(MCP_SDA,MCP_SCL,400000);
    uint8_t i2c_address[8]={0x60,0x61,0x62,0x63,0x64,0x65,0x66,0x67};
    int index_address=0;
    int found_address=0;
    int error;
    for(index_address=0;index_address<8;index_address++)
    {
      MCP4728_I2C.beginTransmission(i2c_address[index_address]);
      error = MCP4728_I2C.endTransmission();
      if (error == 0)
      {
        Serial.print("I2C device found at address");
        Serial.print(i2c_address[index_address]);
        Serial.println("  !");
        found_address=index_address;
        break;
        
