Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32_master/src/Main.cpp
          }
        }  
      }
      //print log from espnow
      ESPNOW_Message receivedMsg;
      if (xQueueReceive(messageQueueHandle, &receivedMsg, (TickType_t)0) == pdTRUE)
      {
        Serial.print("[L]");
        Serial.println(receivedMsg.text);
        Serial.println("");
      }
      /*
      if(getESPNOWLog_b)
      {
        getESPNOWLog_b=false;
        Serial.print("[L]");
        Serial.println(espnowLog);
      }
      */

      //debug message print
      if(PedalUpdateIntervalPrint_b)
      {
        if(PedalUpdateIntervalPrint_trigger)
        {
          for(pedalIDX=0;pedalIDX<3;pedalIDX++)
          {
            if(dap_bridge_state_st.payloadBridgeState_.Pedal_availability[pedalIDX]==1)
            {
              Serial.print("[L]Pedal ");
              Serial.print(pedalIDX);
              Serial.print(" Update interval: ");
              Serial.print(current_time-pedal_last_update[pedalIDX]);
              Serial.print(" RSSI: ");
              Serial.println(rssi[pedalIDX]);
            }
            
          }
          Serial.print("[L]sending:");
          print_struct_hex(&dap_bridge_state_st);
        }
        PedalUpdateIntervalPrint_b=false;
      }
    }
    
    
    //delay(1);
  }
}

void joystickUpdateTask( void * pvParameters )
{
  unsigned long last_serial_joy_out = millis();
  unsigned long now;
  uint16_t pedalJoystick_last[3] = {0, 0, 0};
  bool pedalJoystickUpdate_b = false;
  for(;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0)
    {
      for (int i = 0; i < 3; i++)
      {
        if (pedalJoystick_last[i] != Joystick_value_original[i])
        {
          pedalJoystick_last[i] = Joystick_value_original[i];
          pedalJoystickUpdate_b = true;
        }
      }
      #ifdef USB_JOYSTICK
        if (IsControllerReady() && pedalJoystickUpdate_b)
        {
          if (pedal_status == 0)
          {
            SetControllerOutputValueAccelerator(pedal_cluth_value);
            SetControllerOutputValueBrake(pedal_brake_value);
            SetControllerOutputValueThrottle(pedal_throttle_value);
            SetControllerOutputValueRudder(0);
            SetControllerOutputValueRudder_brake(0, 0);
          }
          if (pedal_status == 1)
          {
            SetControllerOutputValueAccelerator(0);
            SetControllerOutputValueBrake(0);
            SetControllerOutputValueThrottle(0);
            // 3% deadzone
            if (pedal_throttle_value < ((int16_t)(0.47 * JOYSTICK_RANGE)) || pedal_throttle_value > ((int16_t)(0.53 * JOYSTICK_RANGE)))
            {
              SetControllerOutputValueRudder(JOYSTICK_RANGE - pedal_throttle_value);
            }
            else
            {
              SetControllerOutputValueRudder((int16_t)(0.5 * JOYSTICK_RANGE));
            }
            SetControllerOutputValueRudder_brake(0, 0);
          }
          if (pedal_status == 2)
          {
            SetControllerOutputValueAccelerator(0);
            SetControllerOutputValueBrake(0);
            SetControllerOutputValueThrottle(0);
            SetControllerOutputValueRudder((int16_t)(0.5 * JOYSTICK_RANGE));
            // int16_t filter_brake=0;
            // int16_t filter_throttle=0;
            if (dap_bridge_state_st.payloadBridgeState_.Pedal_availability[0] == 1)
            {
              SetControllerOutputValueRudder_brake(pedal_cluth_value, pedal_throttle_value);
            }
            else
            {
              SetControllerOutputValueRudder_brake(pedal_brake_value, pedal_throttle_value);
            }
          }

          if (pedalJoystickUpdate_b)
          {
            joystickSendState();
            pedalJoystickUpdate_b = false;
          }

          // bool joystatus=GetJoystickStatus();
        }
        if (!GetJoystickStatus())
        {
          RestartJoystick();
          Serial.println("[L]HID Error, Restart Joystick...");
          // last_serial_joy_out=millis();
        }
      #endif
      // set analog value
      #ifdef Using_analog_output

        dacWrite(Analog_brk, (uint16_t)((float)((Joystick_value[1]) / (float)(JOYSTICK_RANGE)) * 255));
        dacWrite(Analog_gas, (uint16_t)((float)((Joystick_value[2]) / (float)(JOYSTICK_RANGE)) * 255));
      #endif
      // set MCP4728 analog value
      #ifdef Using_MCP4728
        // Serial.print("MCP/");
        now = millis();
        if (MCP_status)
        {
          /*
          if(now-last_serial_joy_out>1000)
          {
            Serial.print("MCP/");
            Serial.print(Joystick_value[0]);
            Serial.print("/");
            Serial.print(Joystick_value[1]);
            Serial.print("/");
            Serial.print(Joystick_value[2]);
          }
          */

          mcp.setChannelValue(MCP4728_CHANNEL_A, (uint16_t)((float)Joystick_value[0] / (float)JOYSTICK_RANGE * 0.8f * 4096));
          mcp.setChannelValue(MCP4728_CHANNEL_B, (uint16_t)((float)Joystick_value[1] / (float)JOYSTICK_RANGE * 0.8f * 4096));
          mcp.setChannelValue(MCP4728_CHANNEL_C, (uint16_t)((float)Joystick_value[2] / (float)JOYSTICK_RANGE * 0.8f * 4096));
        }

      #endif
    }
  }
}

//OTA multitask
uint16_t OTA_count=0;
bool message_out_b=false;
bool OTA_enable_start=false;
uint32_t otaTask_stackSizeIdx_u32 = 0;
void otaUpdateTask( void * pvParameters )
{

  for(;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0)
    {
      #ifdef OTA_Update
        if(OTA_count>200)
        {
          message_out_b=true;
          OTA_count=0;
        }
        else
        {
          OTA_count++;
        }

        
        if(OTA_enable_b)
        {
          if(message_out_b)
          {
            message_out_b=false;
            Serial1.println("[L]OTA enable flag on");
          }
          if(OTA_status)
          {
            
            //server.handleClient();
          }
          else
          {
            Serial.println("[L]de-initialize espnow");
            Serial.println("[L]wait...");
            esp_err_t result= esp_now_deinit();
            ESPNow_initial_status=false;
            ESPNOW_status=false;
            delay(200);
            if(result==ESP_OK)
            {
              OTA_status=true;
              delay(1000);
              //ota_wifi_initialize(APhost);
              wifi_initialized(SSID,PASS);
              delay(2000);
              ESP32OTAPull ota;
              char* Version_tag;
              int ret;
              ota.SetCallback(OTAcallback);
              ota.OverrideBoard(BRIDGE_BOARD);
              Version_tag=BRIDGE_FIRMWARE_VERSION;
              if(dap_action_ota_st.payloadOtaInfo_.ota_action==1)
              {
                Version_tag="0.0.0";
                Serial.println("Force update");
              }
              switch (dap_action_ota_st.payloadOtaInfo_.mode_select)
              {
                case 1:
                  Serial.printf("[L]Flashing to latest Main, checking %s to see if an update is available...\n", JSON_URL_main);
                  ret = ota.CheckForOTAUpdate(JSON_URL_main, Version_tag);
                  Serial.printf("[L]CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                  break;
                case 2:
                  Serial.printf("[L]Flashing to latest Dev, checking %s to see if an update is available...\n", JSON_URL_dev);
                  ret = ota.CheckForOTAUpdate(JSON_URL_dev, Version_tag);
                  Serial.printf("[L]CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                  break;
                case 3:
                  Serial.printf("[L]Flashing to Daily build, checking %s to see if an update is available...\n", JSON_URL_dev);
                  ret = ota.CheckForOTAUpdate(JSON_URL_daily, Version_tag);
                  Serial.printf("[L]CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                  break;
                default:
                break;
              }

